ASAO-KYOICHI/SVC_RCL_PG/tmpm380_WCONT.c
/***
 * 題名：水位制御アプリ
 * 作成者：浅尾　享一
 * 水位制御を行うアプリケーション
***/
#include "tmpm380_WCONT.h"

void WCONT(void)
{
    OS_TSKCon1 *OS_LoadTime;/* OS設定値を読むためのポインタ構造体に名前をつける */
    OS_LoadTime = OSTSKCon1S();/* 関数経由でポインタをOSparamにアクセス */
    
    uint8_t REG_00, REG_01 = 0;/* 計算用一時変数 */
    
    if (TNO > 0) {
        /* ｾﾙﾌﾃｽﾄ中である場合 */
        OS_LoadTime->NEXT_LOAD_Time[4] = 100;/* 次回呼び出し時間 */
        OS_LoadTime->TSK_COND[4] = 0xA0;/* 遅延フラグ建築 */
        
        return;
        
    }
    
    WLCWT++;/* 水位制御タイマ―をインクリメント */
    if (WLCWT >= 50) {
        /* 5秒以上経過した場合 */
        WLCWT = 50;/* MAX FIX */
        
    }
    
    REG_00 = MXINO0;/* 水位データをロード */
    REG_00 &= 0x0F;/* マスク */
    WLNEW = REG_00;/* 新しいものを保存 */
    REG_00 ^= WLOLD;/* 旧水位電極情報との変化を確認 */
    
    if ((REG_00 & 0x08) > 0) {
        /* 低温槽のHIGHが変化している場合 */
        NHILCT++;/* タイマインクリメント */
        if (NHILCT >= 30) {
            /* 3秒経過した場合 */
            REG_01 = WLNEW;/* 新セット */
            WLOLD &= 0xF7;/* 一旦クリア */
            WLOLD |= (WLNEW & 0x08);/* 更新セット */
            NHILCT = 0;/* タイマクリア */
            
        }
        
    } else {
        /* 低温槽のHIGHが変化していない場合 */
        NHILCT = 0;/* タイマクリア */
        
    }
    
    if ((REG_00 & 0x04) > 0) {
        /* 低温槽のLOWが変化している場合 */
        NLOLCT++;/* タイマインクリメント */
        if (NLOLCT >= 30) {
            /* 3秒経過した場合 */
            REG_01 = WLNEW;/* 新セット */
            WLOLD &= 0xFB;/* 一旦クリア */
            WLOLD |= (WLNEW & 0x04);/* 更新セット */
            NLOLCT = 0;/* タイマクリア */
            
        }
        
    } else {
        /* 低温槽のLOWが変化していない場合 */
        NLOLCT = 0;/* タイマクリア */
        
    }
    
    if ((REG_00 & 0x02) > 0) {
        /* 常温槽のHIGHが変化している場合 */
        CHILCT++;/* タイマインクリメント */
        if (CHILCT >= 30) {
            /* 3秒経過した場合 */
            REG_01 = WLNEW;/* 新セット */
            WLOLD &= 0xFD;/* 一旦クリア */
            WLOLD |= (WLNEW & 0x02);/* 更新セット */
            CHILCT = 0;/* タイマクリア */
            
        }
        
    } else {
        /* 常温槽のHIGHが変化していない場合 */
        CHILCT = 0;/* タイマクリア */
        
    }
    
    if ((REG_00 & 0x01) > 0) {
        /* 常温槽のLOWが変化している場合 */
        CLOLCT++;/* タイマインクリメント */
        if (CLOLCT >= 30) {
            /* 3秒経過した場合 */
            REG_01 = WLNEW;/* 新セット */
            WLOLD &= 0xFE;/* 一旦クリア */
            WLOLD |= (WLNEW & 0x01);/* 更新セット */
            CLOLCT = 0;/* タイマクリア */
            
        }
        
    } else {
        /* 常温槽のLOWが変化していない場合 */
        CLOLCT = 0;/* タイマクリア */
        
    }
    
    if (((WLOLD & 0x03) == 0x02) && ((SYSFLG & 0x40) > 0) && ((ABNF & 0x0F) == 0)) {
        /* 常温槽の電極棒論理矛盾が出ており、電源ONの状態で、何も異常が発生していない場合 */
        ABNF &= 0x30;/* MASK */
        ABNF |= 0x08;/* 常温槽電極棒異常セット */
        
        if ((SYSFLG & 0x02) > 0) {
            /* 運転中である場合 */
            ABNF |= 0x40;/* 継続異常をセット */
            
        } else {
            /* 運転停止中である場合 */
            ABNF |= 0x80;/* 異常停止セット */
            
        }
        
    }
    
    if ( ((SYKND0 & 0x10) == 0) && ((WLOLD & 0x0C) == 0x08) && ((SYSFLG & 0x40) > 0)
    && ( ((ABNF & 0x0F) == 0) || (((ABNF & 0x0F) == 8) && ((SYSFLG & 0x02) > 0))
        || (((ABNF & 0x0F) == 9) && ((SYSFLG & 0x02) > 0)) || (((ABNF & 0x0F) == 14) && ((SYSFLG & 0x02) > 0)) ) ) {
        /* チラー式で、低温槽の電極棒論理矛盾が出ており、電源ONの状態で、「何も異常が発生していない、
        又は運転中で常温槽電極棒異常である、又は運転中で常温槽温度センサ異常である、又は運転中で真空度異常である」場合 */
        ABNF &= 0x30;/* MASK */
        ABNF |= 0x07;/* 低温槽電極棒異常セット */
        ABNF |= 0x80;/* 異常停止セット */
        
        MXOTN0 &= 0xCF;/* 常温・低温給水弁をオフにする */
        MXOTN1 &= 0x7F;/* チラー運転信号をオフにする */
        MXOTN2 &= 0xDF;/* エア抜き弁をオフにする */
        
        WABTM1 = WABTM2 = 0;/* 常温給水異常検知タイマと、低温給水異常検知タイマをクリア */
        
        /* 出力更新 */
        TSB_PG->DATA = MXOTN0;/* 出力セット */
        
        REG_00 = TSB_PN->DATA;/* データをロード */
        REG_00 &= 0x01;/* 0ビット目のみマスクする */
        REG_00 |= (MXOTN1 & 0xFE);/* 必要なデータをセット */
        TSB_PN->DATA = REG_00;/* 出力セット */
        
        REG_00 = TSB_PC->DATA;/* データをロード */
        REG_00 &= 0x07;/* 0～3ビット目のみマスクする */
        REG_00 |= (MXOTN2 & 0xF8);/* 必要なデータをセット */
        TSB_PC->DATA = REG_00;/* 出力セット */
        
        OS_LoadTime->NEXT_LOAD_Time[4] = 100;/* 次回呼び出し時間 */
        OS_LoadTime->TSK_COND[4] = 0xA0;/* 遅延フラグ建築 */
        
        return;/* ここで戻る */
        
    }
    
    if ((SYSFLG & 0x40) == 0) {
        /* 電源オフである場合 */
        WCTM1 = 0;/* 洗浄時の電動弁動作タイマをクリアする */
        WCTM2 = 0;/* 洗浄時のエア抜き弁動作タイマをクリアする */
        
        MXOTN0 |= 0xC0;/* 排水弁を仮でオンする */
        MXOTN2 &= 0xF7;/* チラー循環ポンプをオフにする */
        MXOTN2 &= 0xDF;/* エア抜き弁をオフにする */
        
        WLCTM2 = 0;/* チラー起動遅延タイマをクリア */
        TIRTM1 = 0;/* チラー能力低下確認タイマをクリア */
        
        if ((STSFL1 & 0x10) == 0) {
            /* 排水フラグがOFFである場合 */
            if ((RPAT & 0xC0) > 0) {
                /* 排水状態フラグが何れかONである場合 */
                REG_00 = RPAT;
                REG_00 &= 0xC0;/* 排水状態フラグを切り抜く */
                REG_00 = ~(REG_00);/* 反転 */
                
                REG_00 &= MXOTN0;/* マスク */
                MXOTN0 = REG_00;/* 更新する */
                
            }
            
            if (((SYSFLG & 0x80) == 0) && ((STSFL0 & 0x02) > 0) && (RTCDT[2] == 0) && (RTCDT[1] == 0)) {
                /* 自動排水ありで、イニシャライズ完了しており、時刻が0時0分である場合 */
                RPAT |= 0xC0;/* 排水状態フラグをセット */
                STSFL1 |= 0x10;/* 排水フラグをセットする */
                
                MXOTN0 &= 0x3F;/* 常温・低温排水弁開 */
                WLCTM5++;/* 排水表示時間 */
                if (WLCTM5 >= 3000) {
                    /* 5分経過した場合 */
                    WLCTM5 = 0;/* 排水表示時間クリア */
                    STSFL1 &= 0xEF;/* 排水フラグをクリア */
                    
                }
                
            }
            
        } else {
            /* 排水フラグがONである場合 */
            MXOTN0 &= 0x3F;/* 常温・低温排水弁開 */
            WLCTM5++;/* 排水表示時間 */
            if (WLCTM5 >= 3000) {
                /* 5分経過した場合 */
                WLCTM5 = 0;/* 排水表示時間クリア */
                STSFL1 &= 0xEF;/* 排水フラグをクリア */
                
