ASAO-KYOICHI/SVC_RCL_PG/tmpm380_WCONT.c
            }
            
        }
        
        MXOTN1 &= 0x7F;/* チラー運転信号をオフ */
        
        if ((SYSFLG & 0x01) > 0) {
            /* 排水フラグがONである場合 */
            MXOTN0 &= 0xAF;/* マスク(常温排水弁) */
            WLCTM4++;/* 排水工程タイマーをインクリメント */
            
            if (WLCTM4 >= 3000) {
                /* 排水工程タイマが5分経過した場合 */
                WLCTM4 = 0;/* クリア */
                MXOTN0 |= 0xC0;/* 常温・低温排水弁を閉する */
                SYSFLG &= 0xFE;/* 常温槽排水要求フラグをクリアする */
                
            }
            
        } else {
            /* 排水フラグがOFFである場合 */
            MXOTN0 &= 0xCF;/* 常温・低温排水弁をオフにする */
            WLCTM1 = 0;/* 給水弁起動タイマをクリア */
            
        }
        
        /* 電源オフの場合はここまで */
        
    } else {
        /* 電源オンである場合 */
        if ((RPAT & 0x20) > 0) {
            /* 洗浄モードである場合 */
            WCLEAN();/* 洗浄モードのサブルーチン */
            
            /* 出力更新 */
            TSB_PG->DATA = MXOTN0;/* 出力セット */
            
            REG_00 = TSB_PN->DATA;/* データをロード */
            REG_00 &= 0x01;/* 0ビット目のみマスクする */
            REG_00 |= (MXOTN1 & 0xFE);/* 必要なデータをセット */
            TSB_PN->DATA = REG_00;/* 出力セット */
            
            REG_00 = TSB_PC->DATA;/* データをロード */
            REG_00 &= 0x07;/* 0～3ビット目のみマスクする */
            REG_00 |= (MXOTN2 & 0xF8);/* 必要なデータをセット */
            TSB_PC->DATA = REG_00;/* 出力セット */
            
            OS_LoadTime->NEXT_LOAD_Time[4] = 100;/* 次回呼び出し時間 */
            OS_LoadTime->TSK_COND[4] = 0xA0;/* 遅延フラグ建築 */
            
            return;/* ここで戻る */
            
        } else {
            /* 洗浄モードではない場合 */
            WCTM1 = WCTM2 = 0;/* 洗浄時の */
            WLCTM5 = 0;/* 排水表示時間をクリア */
            RPAT &= 0x3F;/* 排水状態フラグをクリア */
            STSFL1 &= 0xEF;/* 排水フラグをクリア */
            RPAT &= 0x3F;/* 排水状態フラグをクリア */
            
            if ((STSFL0 & 0x20) == 0) {
                /* 準備工程中である場合 */
                if ((SYSFLG & 0x01) > 0) {
                    /* 排水フラグがONである場合 */
                    MXOTN0 &= 0xAF;/* マスク(常温排水弁) */
                    WLCTM4++;/* 排水工程タイマーをインクリメント */
                    
                    if (WLCTM4 >= 3000) {
                        /* 排水工程タイマが5分経過した場合 */
                        WLCTM4 = 0;/* クリア */
                        MXOTN0 |= 0xC0;/* 常温・低温排水弁を閉する */
                        SYSFLG &= 0xFE;/* 常温槽排水要求フラグをクリアする */
                        
                    }
                    
                } else {
                    /* 排水フラグがOFFである場合 */
                    WLCTM4 = 0;/* 排水工程タイマクリア */
                    MXOTN0 |= 0xC0;/* 常温・低温排水弁をオフ */
                    
                    WLCTM1++;/* 給水弁起動待機タイマインクリメント */
                    
                    if (WLCTM1 >= 150) {
                        /* 15秒経過した場合 */
                        WLCTM1 = 150;/* MAX FIX */
                        
                        /* 水位レベルによる制御 */
                        REG_01 = MXOTN0;/* 出力保存 */
                        MXOTN0 &= 0xCF;/* 常温・低温給水弁を閉する */
                        MXOTN1 &= 0x7F;/* チラー運転信号をオフ */
                        
                        WCSETUP(REG_01, WLOLD);/* 出力と水位の値を渡す */
                        
                    }
                    
                }
                
            } else {
                /* 準備工程中では無い場合 */
                WCRUN();/* アイドリング中/運転中の水位制御 */
                
                if ((SYSFLG & 0x01) > 0) {
                    /* 排水フラグがONである場合 */
                    MXOTN0 &= 0xAF;/* マスク(常温排水弁) */
                    WLCTM4++;/* 排水工程タイマーをインクリメント */
                    
                    if (WLCTM4 >= 3000) {
                        /* 排水工程タイマが5分経過した場合 */
                        WLCTM4 = 0;/* クリア */
                        MXOTN0 |= 0xC0;/* 常温・低温排水弁を閉する */
                        SYSFLG &= 0xFE;/* 常温槽排水要求フラグをクリアする */
                        
                    }
                    
                }
                
            }
            
            /* 洗浄モードではない場合ここまで */
            
        }
        
    }
    
    if (((ABNF & 0x0F) == 8) || ((ABNF & 0x0F) == 9)) {
        /* 常温槽電極棒異常、又は常温槽温度センサー異常である場合 */
        MXOTN0 &= 0xBF;/* 常温給水弁をオフにする */
        
        if ((SYSFLG & 0x02) == 0) {
            /* 運転OFFである場合 */
            MXOTN0 &= 0xCF;/* 常温・低温給水弁をオフにする */
            MXOTN1 &= 0x7F;/* チラー運転信号をオフにする */
            MXOTN2 &= 0xD7;/* エア抜き弁、チラー循環Pをオフにする */
            
            WABTM1 = WABTM2 = 0;/* 常温給水異常検知タイマと、低温給水異常検知タイマをクリア */
            
            /* 出力更新 */
            TSB_PG->DATA = MXOTN0;/* 出力セット */
            
            REG_00 = TSB_PN->DATA;/* データをロード */
            REG_00 &= 0x01;/* 0ビット目のみマスクする */
            REG_00 |= (MXOTN1 & 0xFE);/* 必要なデータをセット */
            TSB_PN->DATA = REG_00;/* 出力セット */
            
            REG_00 = TSB_PC->DATA;/* データをロード */
            REG_00 &= 0x07;/* 0～3ビット目のみマスクする */
            REG_00 |= (MXOTN2 & 0xF8);/* 必要なデータをセット */
            TSB_PC->DATA = REG_00;/* 出力セット */
            
        } else {
            /* 運転ONである場合 */
            if ( (((SYKND0 & 0x10) == 0) && (CCSEQ >= 4))
            || (((SYKND0 & 0x10) > 0) && (CCSEQ >= 9)) ) {
                /* チラー式で常温冷却工程を終了している場合、
                又は蒸気式で冷却工程を終了している場合 */
                if ((MXOTN0 & 0x10) == 0) {
                    /* 常温給水弁がOFFの場合 */
                    WABTM1 = 0;/* 常温給水異常検知タイマをクリア */
                    
                } else {
                    /* 常温給水弁がONである場合 */
                    WABTM1++;/* タイマをインクリメント */
                    if (WABTM1 >= 9000) {
                        /* 15分経過した場合 */
                        ABNF &= 0x30;/* マスクする */
                        ABNF |= 0x85;/* ブザーフラグ、給水異常をセット */
                        
                    }
                    
                }
                
            } else {
                /* チラー式で常温冷却工程を終了していないか、
                蒸気式で冷却工程を終了していない場合 */
                MXOTN0 |= 0x10;/* 常温給水弁をオン */
                WABTM1 = 0;/* 常温給水異常検知タイマをクリア */
                
