ASAO-KYOICHI/SVC_RCL_PG/tmpm380_WCONT.c
            }
            
            if ((MXOTN0 & 0x20) == 0) {
                /* 低温給水弁がオフである場合 */
                WABTM2 = 0;/* タイマクリア */
                
            } else {
                /* 低温給水弁がオンである場合 */
                WABTM2++;/* タイマをインクリメント */
                if (WABTM2 >= 9000) {
                    /* 15分経過した場合 */
                    ABNF &= 0x30;/* マスクする */
                    ABNF |= 0x85;/* ブザーフラグ、給水異常をセット */
                    
                }
                
            }
            
            /* 出力更新 */
            TSB_PG->DATA = MXOTN0;
            
            REG_00 = TSB_PN->DATA;/* データをロード */
            REG_00 &= 0x01;/* 0ビット目のみマスクする */
            REG_00 |= (MXOTN1 & 0xFE);/* 必要なデータをセット */
            TSB_PN->DATA = REG_00;/* 出力セット */
            
            REG_00 = TSB_PC->DATA;/* データをロード */
            REG_00 &= 0x07;/* 0～3ビット目のみマスクする */
            REG_00 |= (MXOTN2 & 0xF8);/* 必要なデータをセット */
            TSB_PC->DATA = REG_00;/* 出力セット */
            
        }
        
    } else if (((ABNF & 0x0F) == 0) || ((ABNF & 0x0F) == 14)) {
        /* 異常なしか、真空度異常である場合 */
        if ((MXOTN0 & 0x10) == 0) {
            /* 常温給水弁がOFFの場合 */
            WABTM1 = 0;/* 常温給水異常検知タイマをクリア */
            
        } else {
            /* 常温給水弁がONである場合 */
            WABTM1++;/* タイマをインクリメント */
            if (WABTM1 >= 9000) {
                /* 15分経過した場合 */
                ABNF &= 0x30;/* マスクする */
                ABNF |= 0x85;/* ブザーフラグ、給水異常をセット */
                
            }
            
        }
        
        if ((MXOTN0 & 0x20) == 0) {
            /* 低温給水弁がオフである場合 */
            WABTM2 = 0;/* タイマクリア */
            
        } else {
            /* 低温給水弁がオンである場合 */
            WABTM2++;/* タイマをインクリメント */
            if (WABTM2 >= 9000) {
                /* 15分経過した場合 */
                ABNF &= 0x30;/* マスクする */
                ABNF |= 0x85;/* ブザーフラグ、給水異常をセット */
                
            }
            
        }
        
        /* 出力更新 */
        TSB_PG->DATA = MXOTN0;/* 出力セット */
        
        REG_00 = TSB_PN->DATA;/* データをロード */
        REG_00 &= 0x01;/* 0ビット目のみマスクする */
        REG_00 |= (MXOTN1 & 0xFE);/* 必要なデータをセット */
        TSB_PN->DATA = REG_00;/* 出力セット */
        
        REG_00 = TSB_PC->DATA;/* データをロード */
        REG_00 &= 0x07;/* 0～3ビット目のみマスクする */
        REG_00 |= (MXOTN2 & 0xF8);/* 必要なデータをセット */
        TSB_PC->DATA = REG_00;/* 出力セット */
        
    } else {
        /* 上記以外の異常である場合 */
        MXOTN0 &= 0xCF;/* 常温・低温給水弁をオフにする */
        MXOTN1 &= 0x7F;/* チラー運転信号をオフにする */
        MXOTN2 &= 0xD7;/* エア抜き弁、チラー循環Pをオフにする */
        
        WABTM1 = WABTM2 = 0;/* 常温給水異常検知タイマと、低温給水異常検知タイマをクリア */
        
        /* 出力更新 */
        TSB_PG->DATA = MXOTN0;/* 出力セット */
        
        REG_00 = TSB_PN->DATA;/* データをロード */
        REG_00 &= 0x01;/* 0ビット目のみマスクする */
        REG_00 |= (MXOTN1 & 0xFE);/* 必要なデータをセット */
        TSB_PN->DATA = REG_00;/* 出力セット */
        
        REG_00 = TSB_PC->DATA;/* データをロード */
        REG_00 &= 0x07;/* 0～3ビット目のみマスクする */
        REG_00 |= (MXOTN2 & 0xF8);/* 必要なデータをセット */
        TSB_PC->DATA = REG_00;/* 出力セット */
        
    }
    
    OS_LoadTime->NEXT_LOAD_Time[4] = 100;/* 次回呼び出し時間 */
    OS_LoadTime->TSK_COND[4] = 0xA0;/* 遅延フラグ建築 */
    
    return;
    
}

/***
 * 題名：準備中水位制御アプリ
 * 作成者：浅尾　享一
 * 準備中の水位制御を行うアプリケーション
***/
void WCSETUP(uint8_t MX0, uint8_t WLO)
{
    uint16_t REG_00 = 0;/* 一時変数 */
    uint8_t  REG_01 = 0;/* 一時変数 */
    
    if ((SYKND0 & 0x10) == 0) {
        /* チラー式である場合 */
        if ((WLO & 0x03) < 0x03) {
            /* 常温水槽水位がHIGHまでない場合 */
            MXOTN0 |= 0x10;/* 常温水槽の給水弁をオン */
            
        }
        
        if ((WLO & 0x0C) < 0x0C) {
            /* 低温水槽水位がHIGHまでない場合 */
            MXOTN0 |= 0x20;/* 低温水槽の給水弁をオン */
            if ((MXOTN2 & 0x08) == 0) {
                /* チラー循環ポンプがオンしていない場合 */
                return;/* 戻る */
                
            }
            
            if ((WLO & 0x04) == 0) {
                /* 低温水槽のLOWが検知出来ていない場合 */
                MXOTN2 &= 0xD7;/* エア抜き弁とチラー循環Pをオフする */
                return;/* 戻る */
                
            }
            
        }
        
        MXOTN2 &= 0xD7;/* エア抜き弁とチラー循環Pをオフする */
        
        if ((ABNF & 0x10) == 0) {
            /* チラー異常ではない場合 */
            MXOTN2 |= 0x28;/* エア抜き弁とチラー循環ポンプをオンする */
            
        }
        
        WLCTM2++;/* タイマインクリメント */
        if (WLCTM2 < 50) {
            /* 5秒経過していない場合 */
            return;/* 戻る */
            
        }
        
        MXOTN2 &= 0xDF;/* エア抜き弁をオフする */
        
        if (WLCTM2 < 100) {
            /* 10秒経過していない場合 */
            return;/* 戻る */
            
        }
        
        WLCTM2 = 100;/* MAX FIX */
        if ((ABNF & 0x10) > 0) {
            /* チラー異常である場合 */
            TIRTM1 = 0;/* チラー能力低下確認タイマをクリアする */
            
            if ((WLO & 0x05) < 0x05) {
                /* 常温・低温槽水位のLOWが検知出来ていない場合 */
                return;/* 戻る */
                
            }
            
            STSFL0 |= 0x20;/* 準備工程を解除する */
            if ((STSFL0 & 0x80) == 0) {
                /* 設定中では無い場合 */
                DSPSEQ = 0;/* 表示シーケンスをクリア */
                
            }
            
            return;/* 戻る */
            
        }
        
        MXOTN1 |= 0x80;/* チラー運転信号をオンする */
        if ((SYKND0 & 0xC0) == 0x40) {
            /* 50Rである場合 */
            REG_00 = 18000;/* 30分セット */
            REG_01 = 7;/* 低温槽設定温度 */
            
            if ((SYKND0 & 0x20) > 0) {
                /* 15℃仕様の場合 */
                REG_00 = 18000;/* 変更せず30分セット */
                REG_01 = 12;/* 15℃仕様の低温槽設定温度 */
                
            }
            
        } else if ((SYKND0 & 0xC0) == 0x80) {
            /* 100Rである場合 */
            REG_00 = 12000;/* 20分セット */
            REG_01 = 7;/* 低温槽設定温度 */
            
            if ((SYKND0 & 0x20) > 0) {
                /* 15℃仕様の場合 */
                REG_00 = 15000;/* 変更せず25分セット */
                REG_01 = 12;/* 15℃仕様の低温槽設定温度 */
                
