ASAO-KYOICHI/SVC_RCL_PG/tmpm380_WCONT.c
            }
            
        } else {
            /* 35Rである場合 */
            REG_00 = 21000;/* 35分セット */
            REG_01 = 10;/* 低温槽設定温度 */
            
            if ((SYKND0 & 0x20) > 0) {
                /* 15℃仕様の場合 */
                REG_00 = 18000;/* 変更せず30分セット */
                REG_01 = 13;/* 15℃仕様の低温槽設定温度 */
                
            }
            
        }
        
        if (TMPDT1 <= (short)REG_01) {
            /* 低温槽温度が低温槽設定温度以下になった場合 */
            if (TIRTM1 < REG_00) {
                /* 設定時間未満経過していた場合 */
                ABNF &= 0xDF;/* チラー能力低下をクリア */
                
            }
            
            TIRTM1 = 0;/* チラー能力低下確認タイマをクリアする */
            
            if ((WLO & 0x05) < 0x05) {
                /* 常温・低温槽水位のLOWが検知出来ていない場合 */
                return;/* 戻る */
                
            }
            
            STSFL0 |= 0x20;/* 準備工程を解除する */
            if ((STSFL0 & 0x80) == 0) {
                /* 設定中では無い場合 */
                DSPSEQ = 0;/* 表示シーケンスをクリア */
                
            }
            
        } else {
            /* 低温槽温度が低温槽設定温度より大きい値である場合 */
            TIRTM1++;/* チラー能力低下確認タイマインクリメント */
            if (TIRTM1 >= REG_00) {
                /* 設定時間以上経過した場合 */
                ABNF |= 0x20;/* チラー能力低下セット */
                TIRTM1 = REG_00;/* MAX FIX */
                
            }
            
        }
        
    } else {
        /* 蒸気式である場合 */
        if ((WLO & 0x03) < 0x03) {
            /* 常温水槽水位がHIGHまでない場合 */
            MXOTN0 |= 0x10;/* 常温水槽の給水弁をオン */
            
            if ((MXOTN2 & 0x08) == 0) {
                /* クーリングタワー（チラー循環）Pがオフの場合 */
                return;/* 戻る */
                
            }
            
            if ((WLO & 0x01) == 0) {
                /* 常温槽水槽のLOW検知が出来ていない場合 */
                MXOTN2 &= 0xD7;/* エア抜き弁とクーリングタワー循環ポンプをオフにする */
                return;/* 戻る */
                
            }/* 常温槽水槽のLOW検知が出来ている場合はここに抜ける */
            
        }/* 常温槽水槽がHIGH・LOWともに検知している場合はここに抜ける */
        
        MXOTN2 |= 0x28;/* エア抜き弁とクーリングタワー循環ポンプをオンにする */
        
        WLCTM2++;/* クーリングタワー運転信号遅延タイマをインクリメント */
        if (WLCTM2 < 50) {
            /* 5秒未満である場合 */
            return;/* 戻る */
            
        }
        
        MXOTN2 &= 0xDF;/* エア抜き弁をオフにする */
        if (WLCTM2 < 100) {
            /* 10秒未満である場合 */
            return;/* 戻る */
            
        }
        
        WLCTM2 = 100;/* MAX FIX */
        MXOTN1 |= 0x80;/* クーリングタワー運転信号をオンにする */
        
        if ((WLO & 0x01) > 0) {
            /* 常温槽の水位がLOW以上にある場合 */
            STSFL0 |= 0x20;/* 準備工程完了 */
            
            if ((STSFL0 & 0x80) == 0) {
                /* 設定モードではない場合 */
                DSPSEQ = 0;/* ディスプレーシーケンスをクリア */
                
            }
            
        }/* 常温槽水位がLOW未満の場合はここに抜ける */
        
    }
    
    return;/* 戻る */
    
}

/***
 * 題名：アイドリング/運転中の水位制御アプリ
 * 作成者：浅尾　享一
 * アイドリング中又は運転中の水位制御を行うアプリケーション
***/
void WCRUN(void)
{
    uint8_t  REG_00 = 0;/* 一時変数 */
    
    MXOTN2 |= 0x08;/* チラー循環ポンプをオンする */
    REG_00 = MXOTN0;/* 出力を保存 */
    
    MXOTN0 &= 0xCF;/* 常温・低温の給水弁を閉にする */
    
    if ((SYKND0 & 0x10) == 0) {
        /* チラー式である場合 */
        if ((SYSFLG & 0x01) == 0) {
            /* 常温槽排水工程中で無い場合 */
            WLCTM4 = 0;/* タイマをクリアする */
            if ((WLOLD & 0x03) == 0x03) {
                /* 常温槽水槽の水位がHIGHまである場合 */
                WABTM1 = 0;/* 常温槽給水異常検知タイマをクリア */
                
            } else if ( ((WLOLD & 0x01) == 0) || (((WLOLD & 0x01) > 0) && ((REG_00 & 0x10) > 0)) ) {
                /* 常温槽水槽の水位がLOW未満である場合 */
                /* 常温槽水槽の水位がLOW以上で前回の給水弁出力がONである場合 */
                MXOTN0 |= 0x10;/* 常温槽水槽の給水弁を開にする */
                
            }
            
        }
        
        MXOTN1 &= 0x7F;/* チラー運転をオフにする */
        
        if ((WLOLD & 0x0C) > 0) {
            /* 低温水槽の水位がLOW以上ある場合 */
            MXOTN1 |= 0x80;/* チラー運転信号をオンする */
            
            if ((SYSFLG & 0x02) > 0) {
                /* 運転中である場合 */
                if (CCSEQ >= 10) {
                    /* 真空解除中である場合 */
                    if ((WLOLD & 0x0C) == 0x04) {
                        /* 水位がLo以上、High未満の場合 */
                        MXOTN0 |= 0x20;/* 低温槽水槽の給水弁をオンする */
                        
                    } else if ((WLOLD & 0x0C) == 0x0C) {
                        /* 水位が満水である場合 */
                        WABTM2 = 0;/* 低温槽給水異常検知タイマをクリア */
                        
                    } else if ((REG_00 & 0x20) > 0) {
                        /* 前回給水弁をオンしていた場合 */
                        if ((SYSFLG & 0x02) > 0) {
                            /* 運転中である場合 */
                            MXOTN1 |= 0x80;/* チラー運転信号をオンする */
                            
                        }
                        MXOTN0 |= 0x20;/* 低温槽水槽の給水弁をオンする */
                        
                    }
                    
                }/* 真空解除まで来ていない場合はここに抜ける */
                
            } else {
                /* 運転停止である場合 */
                if ((WLOLD & 0x0C) == 0x0C) {
                    /* 水位が満水である場合 */
                    WABTM2 = 0;/* 低温槽給水異常検知タイマをクリア */
                    
                } else if ((REG_00 & 0x20) > 0) {
                    /* 前回給水弁をオンしていた場合 */
                    if ((SYSFLG & 0x02) > 0) {
                        /* 運転中である場合 */
                        MXOTN1 |= 0x80;/* チラー運転信号をオンする */
                        
                    }
                    MXOTN0 |= 0x20;/* 低温槽水槽の給水弁をオンする */
                    
                }
                
            }
            
        } else {
            /* 低温槽水槽に水が無い場合 */
            if ((SYSFLG & 0x02) > 0) {
                /* 運転中である場合 */
                MXOTN1 |= 0x80;/* チラー運転信号をオンする */
                
            }
            MXOTN0 |= 0x20;/* 低温槽水槽の給水弁をオンする */
            
