ASAO-KYOICHI/SVC_RCL_PG/tmpm380_WCONT.c
        }
        
        /* 水温による常温水槽の給水制御 */
        if (((SYSFLG & 0x0C) > 0) && (CCSEQ < 4) && (TMPDT2 >= (short)SWTMP0)) {
            /* 冷却工程中であり、常温冷却がまだ終了していない状態で、常温槽水温が設定温度以上ある場合 */
            if (((short)SWTMP0 < TMPDT2) || ((REG_00 & 0x10) > 0)) {
                /* 設定値より、常温槽水温が大きい場合か、前回の常温槽給水弁出力がオンである場合 */
                MXOTN0 |= 0x10;/* 常温槽の給水弁をオンする */
                
            }
            
        }
        
        if ((ABNF & 0x10) > 0) {
            /* チラー異常が出ている場合 */
            MXOTN2 &= 0xD7;/* エア抜き弁とチラー循環ポンプをオフする */
            MXOTN1 &= 0x7F;/* チラー運転信号をオフにする */
            
            if (((SYSFLG & 0x08) > 0) && (CCSEQ >= 5) && (CCSEQ < 9)) {
                /* 冷却運転中であり、低温槽冷却工程である（CCSEQ:5～8）場合 */
                WABTM2 = 0;/* 冷却槽給水異常タイマをクリアする */
                MXOTN0 |= 0x20;/* 低温槽給水弁をオンする */
            }
            
        }/* チラー異常がない場合はここに抜ける */
        
    } else {
        /* 蒸気式である場合 */
        WLCTM4 = 0;/* 排水工程タイマをクリアする */
        if ((WLOLD & 0x03) == 0x03) {
            /* 常温槽水槽水位がHIGHまである場合 */
            WABTM1 = 0;/* タイマーをクリアする */
            
        } else {
            /* 常温槽水位がHIGH未満である場合 */
            MXOTN0 |= 0x10;/* 常温槽の給水弁オン */
            
        }
        
        MXOTN1 &= 0x7F;/* クーリングタワー運転信号をオフ */
        if ((WLOLD & 0x03) > 0) {
            /* 常温槽水位が水有りの場合 */
            MXOTN1 |= 0x80;/* クーリングタワー運転信号オン */
            
        }
        
        /* 水温による常温水槽の給水制御 */
        if (((SYSFLG & 0x0C) > 0) && (TMPDT2 >= (short)SWTMP0)) {
            /* 冷却工程中で、常温水槽温度が設定値以上である場合 */
            if (((short)SWTMP0 < TMPDT2) || ((REG_00 & 0x10) > 0)) {
                /* 設定値より、常温槽水温が大きい場合か、前回の常温槽給水弁出力がオンである場合 */
                MXOTN0 |= 0x10;/* 常温槽の給水弁をオンする */
                
            }
            
        }
        
        if ((ABNF & 0x10) > 0) {
            /* チラー異常が出ている場合 */
            MXOTN2 &= 0xD7;/* エア抜き弁とチラー循環ポンプをオフする */
            MXOTN1 &= 0x7F;/* チラー運転信号をオフにする */
            
            if (((SYSFLG & 0x08) > 0) && (CCSEQ >= 5) && (CCSEQ < 9)) {
                /* 冷却運転中であり、低温槽冷却工程である（CCSEQ:5～8）場合 */
                WABTM2 = 0;/* 冷却槽給水異常タイマをクリアする */
                MXOTN0 |= 0x20;/* 低温槽給水弁をオンする */
            }
            
        }/* チラー異常がない場合はここに抜ける */
        
    }
    
    return;/* 戻る */
    
}

/***
 * 題名：洗浄モード中の水位制御アプリ
 * 作成者：浅尾　享一
 * 洗浄中の水位制御を行うアプリケーション
***/
void WCLEAN(void)
{
    uint8_t  REG_00, REG_01 = 0;/* 一時変数 */
    
    REG_00 = MXOTN0;
    REG_00 &= 0xF0;/* 排水弁と給水弁の状態をキープ */
    REG_01 = MXOTN2;
    REG_01 &= 0x28;/* エア抜き弁とチラー循環Pをキープ */
    REG_01 >>= 3;/* 3bit右シフト */
    REG_00 |= REG_01;/* 1つに集約 */
    
    if ((ABNF & 0x0F) > 0) {
        /* 異常が発生している場合 */
        MXOTN0 &= 0xCF;/* 排水弁以外の給水関係出力をオフする */
        MXOTN1 &= 0x7F;/* クリア */
        MXOTN2 &= 0xD7;/* エア抜き弁とチラー循環Pクリア */
        
        return;/* 戻る */
        
    }
    
    MXOTN0 &= 0x0F;/* 水位関係の制御出力を全てオフにする */
    MXOTN1 &= 0x7F;/* オフ */
    MXOTN2 &= 0xD7;/* エア抜き弁とチラー循環Pをオフ */
    
    if (CCSEQ < 20) {
        /* 洗浄工程が異常である場合 */
        return;/* 洗浄工程が異常である場合 */
        
    }
    
    REG_01 = CCSEQ;/* シーケンス番号を読み込む */
    REG_01 -= 20;/* 20減算 */
    REG_01 &= 0x07;/* マスク */
    
    if ((SYKND0 & 0x10) > 0) {
        /* 蒸気式である場合 */
        MXOTN0 |= 0x80;/* 蒸気エジェクタ排水弁を閉にする */
        REG_01 += 8;/* 蒸気式用に８を加算 */
        
    }
    
    /* 洗浄モード番号によって処理切替する↓ */
    if (REG_01 == 0) {
        /* 初期給水制御 */
        MXOTN0 |= 0xC0;/* 排水弁を全て閉する */
        WCTM1++;/* タイマをインクリメント */
        
        if (WCTM1 >= 150) {
            /* 15秒経過した場合 */
            WCTM1 = 150;/* MAX FIX */
            
            if ((WLOLD & 0x02) == 0) {
                /* 常温水槽の水位がHIGH未検知の場合 */
                MXOTN0 |= 0x10;/* 常温給水弁をオンする */
                
            }
            
            if ((WLOLD & 0x08) == 0) {
                /* 低温水槽の水位がHIGH未検知の場合 */
                MXOTN0 |= 0x20;/* 低温給水弁をオンする */
                
            }
            
        }
        
    } else if (REG_01 == 1) {
        /* 常温水槽洗浄中制御 */
        MXOTN0 |= 0xC0;/* 排水弁を全てオフ */
        WCTM1 = 0;/* タイマをクリア */
        
        if (WLCWT >= 50) {
            /* 水位制御遅延タイマが5秒以上である場合 */
            /* 常温水槽 */
            if ((CSEQTM < 10) && ((WLOLD & 0x02) == 0)) {
                /* 洗浄工程が終了しておらず、常温水槽のHIGH水位未検知である場合 */
                if (((WLOLD & 0x01) == 0) || ((REG_00 & 0x10) > 0)) {
                    /* 常温槽水位がLOW未満か、前回の給水弁が動作している場合 */
                    MXOTN0 |= 0x10;/* 常温給水弁をオンする */
                    
                }
                
            }
            
            /* 低温水槽 */
            if ((WLOLD & 0x08) == 0) {
                /* 低温槽水位のHIGHを未検知である場合 */
                MXOTN0 |= 0x20;/* 低温槽給水弁をオン */
                
            }
            
            if ((WLOLD & 0x0C) > 0) {
                /* 何れか低温槽水位検知している場合 */
                if ((REG_00 & 0x01) == 0) {
                    /* 前回の循環ポンプがオフである場合 */
                    WCTM2 = 0;/* エア抜き弁タイマをクリア */
                    if ((WLOLD & 0x0C) == 0x0C) {
                        /* 低温水槽の水位がHIGHまである場合 */
                        MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                        
                    }
                    
                } else {
                    /* 前回の循環ポンプがオンしている場合 */
                    MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                    WCTM2++;/* エア抜きタイマをインクリメント */
                    
                    if (WCTM2 >= 50) {
                        /* エア抜きタイマが5秒以上経過した場合 */
                        WCTM2 = 50;/* MAX FIX */
                        MXOTN2 &= 0xDF;/* エア抜き弁をオフ */
                        
                    }
                    
                }
                
            }/* 低温槽水位なしの場合はここに抜ける */
            
        }/* 5秒未満である場合はここに抜ける */
        
    } else if (REG_01 == 2) {
        /* 低温水槽洗浄中制御 */
        MXOTN0 |= 0x80;/* 低温排水弁を閉する */
        
        if (CSEQTM >= 5) {
            /* 排水動作5分経過した場合 */
            MXOTN0 |= 0x40;/* 常温排水弁を閉する */
            WCTM1++;/* 電動弁移動時間タイマをインクリメント */
            if (WCTM1 >= 150) {
                /* 15秒経過した場合 */
                WCTM1 = 150;/* MAX FIX */
                if ((WLOLD & 0x02) == 0) {
                    /* 常温槽水位がHIGHに水無しである場合 */
                    MXOTN0 |= 0x10;/* 常温槽給水弁をオンする */
                    
