ASAO-KYOICHI/SVC_RCL_PG/tmpm380_WCONT.c
                }
                
            }
            
        }/* 排水動作5分経過していない場合はここに抜ける */
        
        if ((WLCWT >= 50) && (CSEQTM < 10)) {
            /* 水位制御遅延タイマが5秒経過していて、洗浄工程が終了していない場合 */
            if ( ((WLOLD & 0x0C) == 0) || (((WLOLD & 0x0C) == 0x04) && ((REG_00 & 0x20) > 0)) ) {
                /* 低温槽水無しか、低温槽LOW飲み水有りで、前回給水していた場合 */
                MXOTN0 |= 0x20;/* 低温槽給水弁をオンする */
                
            }
            
            if ((WLOLD & 0x0C) > 0) {
                /* 低温槽水位が水ありである場合 */
                if ((REG_00 & 0x01) == 0) {
                    /* 循環Pがオフである場合 */
                    WCTM2 = 0;/* 循環Pのエア抜き弁用タイマをクリア */
                    if ((WLOLD & 0x0C) == 0x0C) {
                        /* 低温槽水位が満水である場合 */
                        MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                        
                    }
                    
                } else {
                    /* 循環Pがオンである場合 */
                    MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                    WCTM2++;/* エア抜きタイマをインクリメント */
                    if (WCTM2 >= 50) {
                        /* 5秒経過した場合 */
                        WCTM2 = 50;/* MAX FIX */
                        MXOTN2 &= 0xDF;/* エア抜き弁をオフにする */
                        
                    }
                    
                }
                
            }/* 低温槽水無の場合はここに抜ける */
            
        }/* 水位制御遅延タイマが5秒未満か、洗浄工程が終了している場合はここに抜ける */
        
    } else if (REG_01 == 3) {
        /* 常温水槽すすぎ1制御 */
        MXOTN0 |= 0x40;/* 常温排水弁を閉する */
        
        if ((WLCWT >= 50) && (CSEQTM < 10)) {
            /* 水位制御遅延タイマ5秒経過した場合 */
            if ( ((WLOLD & 0x03) == 0) || (((WLOLD & 0x03) == 0x01) && ((REG_00 & 0x10) > 0)) ) {
                /* 常温槽水無しか、常温槽LOW飲み水有りで、前回給水していた場合 */
                MXOTN0 |= 0x10;/* 常温槽給水弁をオンする */
                
            }
            
        }/* 水位制御遅延タイマが5秒未満の場合はここに抜ける */
        
        if (CSEQTM >= 5) {
            /* 排水動作5分完了した場合 */
            MXOTN0 |= 0x80;/* 低温排水弁を閉する */
            
            WCTM1++;/* 電動弁移動時間タイマインクリメント */
            if (WCTM1 >= 150) {
                /* 15秒経過した場合 */
                WCTM1 = 150;/* 15秒固定 */
                if ((WLOLD & 0x08) == 0) {
                    /* 低温槽水位のHIGHに水無しの場合 */
                    MXOTN0 |= 0x20;/* 低温給水弁をON */
                    
                }
                
                if ((WLOLD & 0x0C) > 0) {
                    /* 低温槽の水位に水がある場合 */
                    if ((REG_00 & 0x01) == 0) {
                        /* 前回の循環ポンプがオフである場合 */
                        WCTM2 = 0;/* 循環ポンプのエア抜き弁タイマをクリア */
                        if ((WLOLD & 0x0C) == 0x0C) {
                            /* 満水である場合 */
                            MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                            
                        }
                        
                    } else {
                        /* 前回の循環ポンプがオンである場合 */
                        MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                        WCTM2++;/* エア抜きタイマをインクリメント */
                        if (WCTM2 >= 50) {
                            /* 5秒経過した場合 */
                            WCTM2 = 50;/* MAX FIX */
                            MXOTN2 &= 0xDF;/* エア抜き弁をオフにする */
                            
                        }
                        
                    }
                    
                }/* 低温槽に水が無い場合はここに抜ける */
                
            }/* 電動弁移動時間が15秒経過していない場合はここに抜ける */
            
        }/* 排水動作5分未完了の場合はここに抜ける */
        
    } else if (REG_01 == 4) {
        /* 低温水槽すすぎ1制御 */
        MXOTN0 |= 0x80;/* 低温排水弁を閉する */
        
        if (CSEQTM >= 5) {
            /* 排水動作5分経過した場合 */
            MXOTN0 |= 0x40;/* 常温排水弁を閉する */
            WCTM1++;/* 電動弁移動時間タイマをインクリメント */
            if (WCTM1 >= 150) {
                /* 15秒経過した場合 */
                WCTM1 = 150;/* MAX FIX */
                if ((WLOLD & 0x02) == 0) {
                    /* 常温槽水位がHIGHに水無しである場合 */
                    MXOTN0 |= 0x10;/* 常温槽給水弁をオンする */
                    
                }
                
            }
            
        }/* 排水動作5分経過していない場合はここに抜ける */
        
        if ((WLCWT >= 50) && (CSEQTM < 10)) {
            /* 水位制御遅延タイマが5秒経過していて、洗浄工程が終了していない場合 */
            if ( ((WLOLD & 0x0C) == 0) || (((WLOLD & 0x0C) == 0x04) && ((REG_00 & 0x20) > 0)) ) {
                /* 低温槽水無しか、低温槽LOW飲み水有りで、前回給水していた場合 */
                MXOTN0 |= 0x20;/* 低温槽給水弁をオンする */
                
            }
            
            if ((WLOLD & 0x0C) > 0) {
                /* 低温槽水位が水ありである場合 */
                if ((REG_00 & 0x01) == 0) {
                    /* 循環Pがオフである場合 */
                    WCTM2 = 0;/* 循環Pのエア抜き弁用タイマをクリア */
                    if ((WLOLD & 0x0C) == 0x0C) {
                        /* 低温槽水位が満水である場合 */
                        MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                        
                    }
                    
                } else {
                    /* 循環Pがオンである場合 */
                    MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                    WCTM2++;/* エア抜きタイマをインクリメント */
                    if (WCTM2 >= 50) {
                        /* 5秒経過した場合 */
                        WCTM2 = 50;/* MAX FIX */
                        MXOTN2 &= 0xDF;/* エア抜き弁をオフにする */
                        
                    }
                    
                }
                
            }/* 低温槽水無の場合はここに抜ける */
            
        }/* 水位制御遅延タイマが5秒未満か、洗浄工程が終了している場合はここに抜ける */
        
    } else if (REG_01 == 5) {
        /* 常温水槽すすぎ2制御 */
        MXOTN0 |= 0x40;/* 常温排水弁を閉する */
        
        if (WLCWT >= 50) {
            /* 水位制御遅延タイマ5秒経過した場合 */
            if (CSEQTM < 10) {
                /* 洗浄工程が終了していない場合 */
                if ( ((WLOLD & 0x03) == 0) || (((WLOLD & 0x03) == 0x01) && ((REG_00 & 0x10) > 0)) ) {
                    /* 常温槽水無しか、常温槽LOW飲み水有りで、前回給水していた場合 */
                    MXOTN0 |= 0x10;/* 常温槽給水弁をオンする */
                    
