ASAO-KYOICHI/SVC_RCL_PG/tmpm380_WCONT.c
                }
                
            }
            
        }/* 水位制御遅延タイマが5秒未満の場合はここに抜ける */
        
        if (CSEQTM >= 5) {
            /* 排水動作5分完了した場合 */
            MXOTN0 |= 0x80;/* 低温排水弁を閉する */
            
            WCTM1++;/* 電動弁移動時間タイマインクリメント */
            if (WCTM1 >= 150) {
                /* 15秒経過した場合 */
                WCTM1 = 150;/* 15秒固定 */
                if ((WLOLD & 0x08) == 0) {
                    /* 低温槽水位のHIGHに水無しの場合 */
                    MXOTN0 |= 0x20;/* 低温給水弁をON */
                    
                }
                
                if ((WLOLD & 0x0C) > 0) {
                    /* 低温槽の水位に水がある場合 */
                    if ((REG_00 & 0x01) == 0) {
                        /* 前回の循環ポンプがオフである場合 */
                        WCTM2 = 0;/* 循環ポンプのエア抜き弁タイマをクリア */
                        if ((WLOLD & 0x0C) == 0x0C) {
                            /* 満水である場合 */
                            MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                            
                        }
                        
                    } else {
                        /* 前回の循環ポンプがオンである場合 */
                        MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                        WCTM2++;/* エア抜きタイマをインクリメント */
                        if (WCTM2 >= 50) {
                            /* 5秒経過した場合 */
                            WCTM2 = 50;/* MAX FIX */
                            MXOTN2 &= 0xDF;/* エア抜き弁をオフにする */
                            
                        }
                        
                    }
                    
                }/* 低温槽に水が無い場合はここに抜ける */
                
            }/* 電動弁移動時間が15秒経過していない場合はここに抜ける */
            
        }/* 排水動作5分未完了の場合はここに抜ける */
        
    } else if (REG_01 == 6) {
        /* 低温水槽すすぎ2制御 */
        MXOTN0 |= 0x80;/* 低温排水弁を閉する */
        
        if (WLCWT >= 50) {
            /* 水位制御遅延タイマが5秒経過している場合 */
            if ( ((WLOLD & 0x0C) == 0) || (((WLOLD & 0x0C) == 0x04) && ((REG_00 & 0x20) > 0)) ) {
                /* 低温槽水無しか、低温槽LOWのみ水有りで、前回給水していた場合 */
                MXOTN0 |= 0x20;/* 低温槽給水弁をオンする */
                
            }
            
            if ((WLOLD & 0x0C) > 0) {
                /* 低温槽水位が水ありである場合 */
                if ((REG_00 & 0x01) == 0) {
                    /* 循環Pがオフである場合 */
                    WCTM2 = 0;/* 循環Pのエア抜き弁用タイマをクリア */
                    if ((WLOLD & 0x0C) == 0x0C) {
                        /* 低温槽水位が満水である場合 */
                        MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                        
                    }
                    
                } else {
                    /* 循環Pがオンである場合 */
                    MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                    WCTM2++;/* エア抜きタイマをインクリメント */
                    if (WCTM2 >= 50) {
                        /* 5秒経過した場合 */
                        WCTM2 = 50;/* MAX FIX */
                        MXOTN2 &= 0xDF;/* エア抜き弁をオフにする */
                        
                    }
                    
                }
                
            }/* 低温槽水無の場合はここに抜ける */
            
        }/* 水位制御遅延タイマが5秒未満の場合はここに抜ける */
        
    } else if (REG_01 == 7) {
        /* 洗浄完了工程 */
        WCTM1 = WCTM2 = 0;/* タイマークリア */
        
    } else if (REG_01 == 8) {
        /* 初期給水制御（蒸気式） */
        MXOTN0 |= 0x40;/* 排水弁を閉する */
        WCTM1++;/* タイマをインクリメント */
        
        if (WCTM1 >= 150) {
            /* 15秒経過した場合 */
            WCTM1 = 150;/* MAX FIX */
            
            if ((WLOLD & 0x02) == 0) {
                /* 常温水槽の水位がHIGH未検知の場合 */
                MXOTN0 |= 0x10;/* 常温給水弁をオンする */
                
            }
            
        }/* 15秒経過していない場合はここに抜ける */
        
    } else if (REG_01 == 9) {
        /* 常温水槽洗浄中制御 */
        MXOTN0 |= 0x40;/* 排水弁をオフ */
        WCTM1 = 0;/* タイマをクリア */
        
        if (WLCWT >= 50) {
            /* 水位制御遅延タイマが5秒以上である場合 */
            /* 常温水槽 */
            if ((WLOLD & 0x02) == 0) {
                /* 常温水槽のHIGH水位未検知である場合 */
                if (((WLOLD & 0x01) == 0) || ((REG_00 & 0x10) > 0)) {
                    /* 常温槽水位がLOW未満か、前回の給水弁が動作している場合 */
                    MXOTN0 |= 0x10;/* 常温給水弁をオンする */
                    
                }
                
            }
            
            if ((WLOLD & 0x03) > 0) {
                /* 何れか常温槽水位検知している場合 */
                if ((REG_00 & 0x01) == 0) {
                    /* 前回の循環ポンプがオフである場合 */
                    WCTM2 = 0;/* エア抜き弁タイマをクリア */
                    if ((WLOLD & 0x03) == 0x03) {
                        /* 常温水槽の水位がHIGHまである場合 */
                        MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                        
                    }
                    
                } else {
                    /* 前回の循環ポンプがオンしている場合 */
                    MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                    WCTM2++;/* エア抜きタイマをインクリメント */
                    
                    if (WCTM2 >= 50) {
                        /* エア抜きタイマが5秒以上経過した場合 */
                        WCTM2 = 50;/* MAX FIX */
                        MXOTN2 &= 0xDF;/* エア抜き弁をオフ */
                        
                    }
                    
                }
                
            }/* 低温槽水位なしの場合はここに抜ける */
            
        }/* 5秒未満である場合はここに抜ける */
        
    } else if (REG_01 == 10) {
        /* 常温水槽排水動作中制御 */
        if (CSEQTM >= 5) {
            /* 排水動作5分経過した場合 */
            MXOTN0 |= 0x40;/* 常温排水弁を閉する */
            WCTM1++;/* 電動弁移動時間タイマをインクリメント */
            if (WCTM1 >= 150) {
                /* 15秒経過した場合 */
                WCTM1 = 150;/* MAX FIX */
                if ((WLOLD & 0x02) == 0) {
                    /* 常温槽水位がHIGHに水無しである場合 */
                    MXOTN0 |= 0x10;/* 常温槽給水弁をオンする */
                    
                }
                
                if ((WLOLD & 0x03) > 0) {
                    /* 常温槽水槽に水がある場合 */
                    if ((REG_00 & 0x01) == 0) {
                        /* 循環Pがオフである場合 */
                        WCTM2 = 0;/* 循環Pのエア抜き弁用タイマをクリア */
                        if ((WLOLD & 0x03) == 0x03) {
                            /* 常温槽水位が満水である場合 */
                            MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                            
