ASAO-KYOICHI/SVC_RCL_PG/tmpm380_WCONT.c
                        }
                        
                    } else {
                        /* 循環Pがオンである場合 */
                        MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                        WCTM2++;/* エア抜きタイマをインクリメント */
                        if (WCTM2 >= 50) {
                            /* 5秒経過した場合 */
                            WCTM2 = 50;/* MAX FIX */
                            MXOTN2 &= 0xDF;/* エア抜き弁をオフにする */
                            
                        }
                        
                    }
                    
                }/* 常温槽水槽に水が無い場合はここに抜ける */
                
            }/* 15秒未満の場合はここに抜ける */
            
        }/* 排水動作5分経過していない場合はここに抜ける */
        
    } else if (REG_01 == 11) {
        /* 常温水槽すすぎ1制御 */
        MXOTN0 |= 0x40;/* 常温排水弁を閉する */
        
        if (WLCWT >= 50) {
            /* 水位制御遅延タイマ5秒経過した場合 */
            if ( ((WLOLD & 0x03) == 0) || (((WLOLD & 0x03) == 0x01) && ((REG_00 & 0x10) > 0)) ) {
                /* 常温槽水無しか、常温槽LOW飲み水有りで、前回給水していた場合 */
                MXOTN0 |= 0x10;/* 常温槽給水弁をオンする */
                
            }
            
            if ((WLOLD & 0x03) > 0) {
                /* 常温槽の水位に水がある場合 */
                if ((REG_00 & 0x01) == 0) {
                    /* 前回の循環ポンプがオフである場合 */
                    WCTM2 = 0;/* 循環ポンプのエア抜き弁タイマをクリア */
                    if ((WLOLD & 0x03) == 0x03) {
                        /* 満水である場合 */
                        MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                        
                    }
                    
                } else {
                    /* 前回の循環ポンプがオンである場合 */
                    MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                    WCTM2++;/* エア抜きタイマをインクリメント */
                    if (WCTM2 >= 50) {
                        /* 5秒経過した場合 */
                        WCTM2 = 50;/* MAX FIX */
                        MXOTN2 &= 0xDF;/* エア抜き弁をオフにする */
                        
                    }
                    
                }
                
            }/* 常温槽に水が無い場合はここに抜ける */
            
        }/* 水位制御遅延タイマが5秒未満の場合はここに抜ける */
        
    } else if (REG_01 == 12) {
        /* 常温水槽排水動作中制御 */
        if (CSEQTM >= 5) {
            /* 排水動作5分経過した場合 */
            MXOTN0 |= 0x40;/* 常温排水弁を閉する */
            WCTM1++;/* 電動弁移動時間タイマをインクリメント */
            if (WCTM1 >= 150) {
                /* 15秒経過した場合 */
                WCTM1 = 150;/* MAX FIX */
                if ((WLOLD & 0x02) == 0) {
                    /* 常温槽水位がHIGHに水無しである場合 */
                    MXOTN0 |= 0x10;/* 常温槽給水弁をオンする */
                    
                }
                
                if ((WLOLD & 0x03) > 0) {
                    /* 常温槽水槽に水がある場合 */
                    if ((REG_00 & 0x01) == 0) {
                        /* 循環Pがオフである場合 */
                        WCTM2 = 0;/* 循環Pのエア抜き弁用タイマをクリア */
                        if ((WLOLD & 0x03) == 0x03) {
                            /* 常温槽水位が満水である場合 */
                            MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                            
                        }
                        
                    } else {
                        /* 循環Pがオンである場合 */
                        MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                        WCTM2++;/* エア抜きタイマをインクリメント */
                        if (WCTM2 >= 50) {
                            /* 5秒経過した場合 */
                            WCTM2 = 50;/* MAX FIX */
                            MXOTN2 &= 0xDF;/* エア抜き弁をオフにする */
                            
                        }
                        
                    }
                    
                }/* 常温槽水槽に水が無い場合はここに抜ける */
                
            }/* 15秒未満の場合はここに抜ける */
            
        }/* 排水動作5分経過していない場合はここに抜ける */
        
    } else if (REG_01 == 13) {
        /* 常温水槽すすぎ2制御 */
        MXOTN0 |= 0x40;/* 常温排水弁を閉する */
        
        if (WLCWT >= 50) {
            /* 水位制御遅延タイマ5秒経過した場合 */
            if ( ((WLOLD & 0x03) == 0) || (((WLOLD & 0x03) == 0x01) && ((REG_00 & 0x10) > 0)) ) {
                /* 常温槽水無しか、常温槽LOW飲み水有りで、前回給水していた場合 */
                MXOTN0 |= 0x10;/* 常温槽給水弁をオンする */
                
            }
            
            if ((WLOLD & 0x03) > 0) {
                /* 常温槽の水位に水がある場合 */
                if ((REG_00 & 0x01) == 0) {
                    /* 前回の循環ポンプがオフである場合 */
                    WCTM2 = 0;/* 循環ポンプのエア抜き弁タイマをクリア */
                    if ((WLOLD & 0x03) == 0x03) {
                        /* 満水である場合 */
                        MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                        
                    }
                    
                } else {
                    /* 前回の循環ポンプがオンである場合 */
                    MXOTN2 |= 0x28;/* エア抜き弁と循環Pをオンする */
                    WCTM2++;/* エア抜きタイマをインクリメント */
                    if (WCTM2 >= 50) {
                        /* 5秒経過した場合 */
                        WCTM2 = 50;/* MAX FIX */
                        MXOTN2 &= 0xDF;/* エア抜き弁をオフにする */
                        
                    }
                    
                }
                
            }/* 常温槽に水が無い場合はここに抜ける */
            
        }/* 水位制御遅延タイマが5秒未満の場合はここに抜ける */
        
    } else if (REG_01 ==14) {
        /* 常温水槽排水中制御 */
        /* 何もしない */
        
    } else {
        /* 洗浄完了制御 */
        WCTM1 = WCTM2 = 0;/* 各タイマークリア */
        
    }
    
    /* 共通制御事項↓ */
    /* 給水弁が開きっぱかどうかの確認 */
    if ((MXOTN0 & 0x10) == 0) {
        /* 常温給水弁がOFFの場合 */
        WABTM1 = 0;/* 常温給水異常検知タイマをクリア */
        
    } else {
        /* 常温給水弁がONである場合 */
        WABTM1++;/* タイマをインクリメント */
        if (WABTM1 >= 9000) {
            /* 15分経過した場合 */
            ABNF &= 0x30;/* マスクする */
            ABNF |= 0x85;/* ブザーフラグ、給水異常をセット */
            
        }
        
    }
    
    if ((MXOTN0 & 0x20) == 0) {
        /* 低温給水弁がオフである場合 */
        WABTM2 = 0;/* タイマクリア */
        
    } else {
        /* 低温給水弁がオンである場合 */
        WABTM2++;/* タイマをインクリメント */
        if (WABTM2 >= 9000) {
            /* 15分経過した場合 */
            ABNF &= 0x30;/* マスクする */
            ABNF |= 0x85;/* ブザーフラグ、給水異常をセット */
            
        }
        
    }
    
    return;/* 戻る */
    
}